#+title: SQL-UI
#+subtitle: A major mode for working with databases inside Emacs

* Maintaining DB Connections
DB Connections are maintained in a JSON file with the same structure as defined
for =sql-lsp= to make it easier to add autocompletion and query execution. To
make it easier to add new connections to the file, there is a helper function

#+begin_src emacs-lisp :tangle yes
(require 'json)
(require 'cl-lib)

(defvar cm/sql-ui-connection-file "~/.local/sql-ui/.sql-ls/config.json")

(defun cm/sql-ui--connection-exists (alias connections)
  "Check if the ALIAS already exists in CONNECTIONS."
  (cl-some (lambda (connection)
             (and (eq (car connection) alias) connection))
           connections))

(defun cm/sql-ui-add-connection (alias new-db-connection)
  "Load a JSON file at FILE-PATH, check if KEY exists,
   and add NEW-JSON-OBJECT if the key is missing.
   Save the updated JSON to the file."
  (unless (f-directory-p (f-dirname cm/sql-ui-connection-file))
      (make-directory (f-dirname cm/sql-ui-connection-file) t))
  (let* ((db-connections (if (file-exists-p cm/sql-ui-connection-file)
                          (with-temp-buffer
                            (insert-file-contents cm/sql-ui-connection-file)
                            (json-read))
                          (list 'connections '())))
         (existing-connections (cdr (assoc 'connections db-connections)))
         (new-connection (push alias new-db-connection)))
    (if (cm/sql-ui--connection-exists alias existing-connections)
        (message "Connection already exists: %s" alias)
      (message "Adding new connection")
      (add-to-list 'existing-connections new-connection)
      (setq db-connections (json-add-to-object (json-new-object) "connections" existing-connections))
      (with-temp-file cm/sql-ui-connection-file
        (insert (json-encode db-connections)))
      )
      ))

#+end_src

#+RESULTS:
: cm/sql-ui-add-connection

#+begin_src emacs-lisp :tangle yes :results raw drawer
(cm/sql-ui-add-connection 'local_mysql '((driver . "mysql") (host . "127.0.0.1") (username . "chahak") (password . "CPM") (database . "mysql")))
#+end_src

#+RESULTS:
:results:
Connection already exists: local_mysql
:end:
